#include <iostream>

/*
2. Да се въведе цяло число в конзолата и да се определи дали то 
се дели на 2 и 3, но не и на 5.
Примерен вход и изход на програмата:
       6 -> true
       60 -> false
*/

int main()
{
	int number;

	// Използвам std::endl за да приключа реда (да въведа нов ред).
	// Използването му не е задължително, въпрос на вкус и стилизация.
	std::cout << "Enter a number: " << std::endl;
	std::cin >> number;

	/*
	Дали едно число се дели на друго, ще считаме факта, че остатъка от
	делението е 0 (т.е. число1 се дели на число2, ако число1 % число2 == 0).

	Логиката за тази задача е както следва:
	Ако числото се дели на 2 и числото се дели на 3 и числото НЕ се дели на 5,
	то тогава изведи "true".
	*/
	if ((number % 2 == 0) && (number % 3 == 0) && (number % 5 != 0))
		std::cout << "true" << std::endl;
	else
		std::cout << "false" << std::endl;

	return 0;
}