#include <iostream>
/*
iostream e библиотеката, която ни позволява
да четем input от конзолата, както и да пишем
output по нея. За по-големите ентусиасти, може
да прочетете за stdin & stdout.
*/

/*
using namespace std;
// Може да го използвате, но е препоръчително да не се ползва,
защото след време като започнем да използваме повече и по-сложни
функции от няколко библиотеки, и чиито имена се повтарят, ще си
имаме доста по-големи проблеми.
*/

/*
У С Л О В И Е:
1. Да се въведат две цели числа в конзолата и да се определи дали първото
е делител на второто.
Примерен вход и изход на програмата:
       2 6 -> true
       3 5 -> false
*/

int main()
{
	int number_a, number_b; // Дефинираме две променливи за двете числа.

	// Въвеждаме първото число.
	std::cout << "Enter the first number: " << std::endl;
	std::cin >> number_a;

	// Въвеждаме второто число.
	std::cout << "Enter the second number: " << std::endl;
	std::cin >> number_b;

	// Ако остатъка от делението число2 / число1 е 0, изведи "true"
	if ((number_b % number_a) == 0)
		std::cout << "true" << std::endl;
	// При всички останали случаи (ако не е 0), изведи "false"
	else
		std::cout << "false" << std::endl;
	/*
	Логиката на if & else е както следва:
	if (АКО) УСЛОВИЕ, тогава изпълни кода на if,
	ако УСЛОВИЕ не е вярно (else) изпълни кода на else.
	*/

	/* 
	int main() е функция, а всяка функция трябва да връща стойност.
	В нашият случай няма значение какво връщаме, затова просто се счита
	за добре да връщаме 0. 
	*/
	return 0;
}